#!/bin/env python3
# -*- coding: utf-8 -*-
# version: Python3.X
''' XD 教务处评估系统, 自己手动选择好累啊, 所以试着用 Python 写一个吧
目前写的这个版本存在大量的硬编码, cj 也有一个版本, 同样是硬编码的
'''
__author__ = '__L1n__w@tch'

import requests


def imitate_login():
    """
    模拟登陆的一种方式
    :return:
    """
    url = "http://jwxt.xidian.edu.cn/"
    session = requests.Session()
    response = session.get(url)
    print(response.text)


def direct_post():
    """
    手动登录, 记录 cookie 后模拟提交, 硬编码成功了, 待以后有机会再改进把
    :return:
    """
    # url = "http://jwxt.xidian.edu.cn/caslogin.jsp"
    url = "http://jwxt.xidian.edu.cn/jxpgXsAction.do?oper=wjpg"
    """
    0000000028#@2909#@李晖#@学生评教-理论教学#@信息论基础#@CE5040
    0000000028#@2909#@李晖#@学生评教-理论教学#@网络对抗原理#@CE5045
    0000000028#@3052#@胡建伟#@学生评教-理论教学#@实习课#@CE1603
    0000000028#@3052#@胡建伟#@学生评教-理论教学#@软件安全与漏洞分析#@CE5041
    0000000028#@3696#@薛文波#@学生评教-理论教学#@德语二外（II）#@FL7014-2
    0000000028#@4399#@张跃宇#@学生评教-理论教学#@无线通信安全#@CE5042
    0000000028#@4653#@崔艳鹏#@学生评教-理论教学#@科技制作-3#@CE1006-3
    0000000028#@4653#@崔艳鹏#@学生评教-理论教学#@实习课#@CE1603
    0000000028#@4653#@崔艳鹏#@学生评教-理论教学#@软件安全与漏洞分析#@CE5041
    0000000028#@5208#@陈刚#@学生评教-理论教学#@就业指导#@HA1007-18
    0000000028#@5208#@陈刚#@学生评教-理论教学#@形势与政策（Ⅵ）#@HA1008-618
    0000000028#@5657#@王子龙#@学生评教-理论教学#@信息论基础#@CE5040
    0000000028#@5682#@葛幸#@学生评教-理论教学#@就业指导#@HA1007-18
    0000000028#@5713#@姜奇#@学生评教-理论教学#@网络协议分析#@CE5039
    0000000028#@6039#@刘雪峰#@学生评教-理论教学#@网络对抗原理#@CE5045
    0000000028#@6240#@伍高飞#@学生评教-理论教学#@网络对抗原理#@CE5045
    0000000028#@w0101#@张玉清#@学生评教-理论教学#@网络对抗原理#@CE5045
    """
    cookies = {"BIGipServerjwxt.xidian.edu.cn": "662271434.20480.0000", "JSESSIONID": "bacbVwEbBttke51MlCLsv"}

    # 测试是否可以获取到主页
    # response = requests.get(url, cookies=cookies)
    # print(response.text)

    post_data = {"wjbm": "0000000028",
                 "bpr": "w0101",
                 "pgnr": "CE5045",
                 "xumanyzg": "zgDA_0000000037",
                 "wjbz": "",
                 "0000000017": "8_1",
                 "0000000019": "6_1",
                 "0000000018": "6_1",
                 "0000000020": "6_1",
                 "0000000021": "7_1",
                 "0000000022": "7_1",
                 "0000000023": "7_1",
                 "0000000025": "7_1",
                 "0000000024": "6_1",
                 "0000000026": "8_1",
                 "0000000027": "8_1",
                 "0000000028": "6_1",
                 "0000000029": "6_1",
                 "0000000030": "6_1",
                 "0000000031": "6_1",
                 "DA_0000000037": "",
                 "zgpj": ""
                 }

    response = requests.post(url, data=post_data, cookies=cookies)
    if "评估成功" not in response.text:
        print(response.text)
    else:
        print("运气好成功了!")


if __name__ == "__main__":
    # imitate_login()
    direct_post()
